app/Controllers/Emprestimo.php

    public function index()
    {
        $dados = $this->emprestimoModel->findAll();
        $alunos = $this->alunoModel->findAll();
        $usuarios = $this->usuarioModel->findAll();
        $livros = $this->livroModel->findAll();
        $obras = $this->obraModel->findAll();
---
SELECT *
FROM `emprestimo`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`
SELECT *
FROM `obra`

     public function cadastrar(){
        $emprestimo = $this->request->getPost();
        $this->emprestimoModel->save($emprestimo);
        $this->livroModel->update($emprestimo['id_livro'],['disponivel' => 0]);
---
INSERT INTO `emprestimo` (`data_inicio`, `prazo`, `id_livro`, `id_usuario`, `id_aluno`) VALUES ('2024-06-21', '15', '13', '13', '10')
UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('13')

    public function editar($id){
        $dados = $this->emprestimoModel->find($id);
        $this->livroModel->update($dados['id_livro'],['disponivel' => 1]);
        $alunos = $this->alunoModel->find();
        $usuarios = $this->usuarioModel->find();
        $livros = $this->livroModel->find();
        $obra = $this->obraModel->find();
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '29'
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('13')
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `livro`
SELECT *
FROM `obra`

    public function salvardev(){
        $emprestimo = $this->request->getPost();
        $this->livroModel->update($emprestimo['id_livro'],['disponivel' => 1]);
        $this->emprestimoModel->save($emprestimo);
---
UPDATE `livro` SET `disponivel` = 1
WHERE `livro`.`id` IN ('13')
UPDATE `emprestimo` SET `id_livro` = '13', `data_fim` = '2024-06-28'
WHERE `emprestimo`.`id` IN ('30')

    public function devolucao($id){
        $emprestimo = $this->emprestimoModel->find($id);
---
SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '31'